Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOB
mcu_data: ksdk2_0
processor_version: 0.2412.10
board: MIMXRT700-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, input_buffer: enable}
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0/LP_FLEXCOMM0_P1/SCT0_OUT9/CTIMER4_MAT1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t RT_P0_31_FC0_RXD = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                       IOPCTL_PIO_FUNC1 |
                                       /* Disable pull-up / pull-down function */
                                       IOPCTL_PIO_PUPD_DI |
                                       /* Enable pull-down function */
                                       IOPCTL_PIO_PULLDOWN_EN |
                                       /* Enables input buffer function */
                                       IOPCTL_PIO_INBUF_EN |
                                       /* Pseudo Output Drain is disabled */
                                       IOPCTL_PIO_PSEDRAIN_DI |
                                       /* Input function is not inverted */
                                       IOPCTL_PIO_INV_DI |
                                       /* Selects transmitter current drive 100ohm */
                                       IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: N4) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PORT, BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN, RT_P0_31_FC0_RXD);

    const uint32_t RT_P1_0_FC0_TXD = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Disable input buffer function */
                                      IOPCTL_PIO_INBUF_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN0 (coords: N5) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PORT, BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN, RT_P1_0_FC0_TXD);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitEMMCPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B6, peripheral: USDHC0, signal: USDHC_CLK, pin_signal: PIO7_0/SDHC0_CLK/LP_FLEXCOMM3_P4/LP_FLEXCOMM7_P6, input_buffer: enable}
  - {pin_num: C7, peripheral: USDHC0, signal: USDHC_CMD, pin_signal: PIO7_1/SDHC0_CMD/LP_FLEXCOMM3_P5/LP_FLEXCOMM7_P5, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: F7, peripheral: USDHC0, signal: 'USDHC_DATA, 4', pin_signal: PIO7_2/SDHC0_DATA4/LP_FLEXCOMM12_P0, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: F6, peripheral: USDHC0, signal: 'USDHC_DATA, 5', pin_signal: PIO7_3/SDHC0_DATA5/LP_FLEXCOMM12_P1, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: E6, peripheral: USDHC0, signal: 'USDHC_DATA, 6', pin_signal: PIO7_4/SDHC0_DATA6/LP_FLEXCOMM12_P2, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: D6, peripheral: USDHC0, signal: 'USDHC_DATA, 7', pin_signal: PIO7_5/SDHC0_DATA7/LP_FLEXCOMM12_P3, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: B7, peripheral: USDHC0, signal: 'USDHC_DATA, 0', pin_signal: PIO7_6/SDHC0_DATA0/LP_FLEXCOMM12_P4, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: B8, peripheral: USDHC0, signal: 'USDHC_DATA, 1', pin_signal: PIO7_7/SDHC0_DATA1/LP_FLEXCOMM12_P5, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: C6, peripheral: USDHC0, signal: 'USDHC_DATA, 2', pin_signal: PIO7_8/SDHC0_DATA2/LP_FLEXCOMM12_P6/LP_FLEXCOMM7_P3, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: A6, peripheral: USDHC0, signal: 'USDHC_DATA, 3', pin_signal: PIO7_9/SDHC0_DATA3/LP_FLEXCOMM3_P6/LP_FLEXCOMM7_P4, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: E5, peripheral: USDHC0, signal: USDHC_STROBE, pin_signal: PIO7_10/SDHC0_WR_PRT/LP_FLEXCOMM1_P0/SDHC0_DS, input_buffer: enable}
  - {pin_num: F8, peripheral: USDHC0, signal: USDHC_RESET_B, pin_signal: PIO7_12/SDHC0_RESET_N/LP_FLEXCOMM1_P2, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

