Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitEMMCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitEMMCPins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t EMMC_CLK = (/* Pin is configured as SDHC0_CLK */
                               IOPCTL_PIO_FUNC1 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN0 (coords: B6) is configured as SDHC0_CLK */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_CLK_PORT, BOARD_INITEMMCPINS_EMMC_CLK_PIN, EMMC_CLK);

    const uint32_t EMMC_CMD = (/* Pin is configured as SDHC0_CMD */
                               IOPCTL_PIO_FUNC1 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN1 (coords: C7) is configured as SDHC0_CMD */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_CMD_PORT, BOARD_INITEMMCPINS_EMMC_CMD_PIN, EMMC_CMD);

    const uint32_t EMMC_DS = (/* Pin is configured as SDHC0_DS */
                              IOPCTL_PIO_FUNC5 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN10 (coords: E5) is configured as SDHC0_DS */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_DS_PORT, BOARD_INITEMMCPINS_EMMC_DS_PIN, EMMC_DS);

    const uint32_t EMMC_RST_N = (/* Pin is configured as SDHC0_RESET_N */
                                 IOPCTL_PIO_FUNC1 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Enables input buffer function */
                                 IOPCTL_PIO_INBUF_EN |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN12 (coords: F8) is configured as SDHC0_RESET_N */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_RST_N_PORT, BOARD_INITEMMCPINS_EMMC_RST_N_PIN, EMMC_RST_N);

    const uint32_t EMMC_D4 = (/* Pin is configured as SDHC0_DATA4 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN2 (coords: F7) is configured as SDHC0_DATA4 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D4_PORT, BOARD_INITEMMCPINS_EMMC_D4_PIN, EMMC_D4);

    const uint32_t EMMC_D5 = (/* Pin is configured as SDHC0_DATA5 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN3 (coords: F6) is configured as SDHC0_DATA5 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D5_PORT, BOARD_INITEMMCPINS_EMMC_D5_PIN, EMMC_D5);

