Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
    const uint32_t EMMC_D6 = (/* Pin is configured as SDHC0_DATA6 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN4 (coords: E6) is configured as SDHC0_DATA6 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D6_PORT, BOARD_INITEMMCPINS_EMMC_D6_PIN, EMMC_D6);

    const uint32_t EMMC_D7 = (/* Pin is configured as SDHC0_DATA7 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN5 (coords: D6) is configured as SDHC0_DATA7 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D7_PORT, BOARD_INITEMMCPINS_EMMC_D7_PIN, EMMC_D7);

    const uint32_t EMMC_D0 = (/* Pin is configured as SDHC0_DATA0 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN6 (coords: B7) is configured as SDHC0_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D0_PORT, BOARD_INITEMMCPINS_EMMC_D0_PIN, EMMC_D0);

    const uint32_t EMMC_D1 = (/* Pin is configured as SDHC0_DATA1 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN7 (coords: B8) is configured as SDHC0_DATA1 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D1_PORT, BOARD_INITEMMCPINS_EMMC_D1_PIN, EMMC_D1);

    const uint32_t EMMC_D2 = (/* Pin is configured as SDHC0_DATA2 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN8 (coords: C6) is configured as SDHC0_DATA2 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D2_PORT, BOARD_INITEMMCPINS_EMMC_D2_PIN, EMMC_D2);

    const uint32_t EMMC_D3 = (/* Pin is configured as SDHC0_DATA3 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN9 (coords: A6) is configured as SDHC0_DATA3 */
    IOPCTL_PinMuxSet(BOARD_INITEMMCPINS_EMMC_D3_PORT, BOARD_INITEMMCPINS_EMMC_D3_PIN, EMMC_D3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSDHCPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: G12, peripheral: USDHC1, signal: USDHC_CARD_DET, pin_signal: PIO7_24/SDHC1_CARD_DET_N/LP_FLEXCOMM13_P4, selects_transmitter_current_drive: O_33, input_buffer: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: L17, peripheral: USDHC1, signal: USDHC_CLK, pin_signal: PIO7_17/SDHC1_CLK/LP_FLEXCOMM2_P0, selects_transmitter_current_drive: O_33, input_buffer: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: L16, peripheral: USDHC1, signal: USDHC_CMD, pin_signal: PIO7_18/SDHC1_CMD/LP_FLEXCOMM2_P1, selects_transmitter_current_drive: O_33, input_buffer: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: M17, peripheral: USDHC1, signal: 'USDHC_DATA, 0', pin_signal: PIO7_19/SDHC1_DATA0/LP_FLEXCOMM1_P4/LP_FLEXCOMM7_P3, selects_transmitter_current_drive: O_33,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: M18, peripheral: USDHC1, signal: 'USDHC_DATA, 1', pin_signal: PIO7_20/SDHC1_DATA1/LP_FLEXCOMM1_P5/LP_FLEXCOMM2_P4, selects_transmitter_current_drive: O_33,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: K18, peripheral: USDHC1, signal: 'USDHC_DATA, 2', pin_signal: PIO7_21/SDHC1_DATA2/LP_FLEXCOMM1_P6/LP_FLEXCOMM2_P5, selects_transmitter_current_drive: O_33,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: K17, peripheral: USDHC1, signal: 'USDHC_DATA, 3', pin_signal: PIO7_22/SDHC1_DATA3/LP_FLEXCOMM2_P2, selects_transmitter_current_drive: O_33, input_buffer: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: C5, peripheral: GPIO7, signal: 'GPIO, 11', pin_signal: PIO7_11/SDHC0_CARD_DET_N/LP_FLEXCOMM1_P1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

