Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSDHCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitSDHCPins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t SD_PWREN_B = (/* Pin is configured as PIO7_11 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN11 (coords: C5) is configured as PIO7_11 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SD_PWREN_B_PORT, BOARD_INITSDHCPINS_SD_PWREN_B_PIN, SD_PWREN_B);

    const uint32_t SDHC1_CLK = (/* Pin is configured as SDHC1_CLK */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 33ohm */
                                IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN17 (coords: L17) is configured as SDHC1_CLK */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SDHC1_CLK_PORT, BOARD_INITSDHCPINS_SDHC1_CLK_PIN, SDHC1_CLK);

    const uint32_t SDHC1_CMD = (/* Pin is configured as SDHC1_CMD */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 33ohm */
                                IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN18 (coords: L16) is configured as SDHC1_CMD */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SDHC1_CMD_PORT, BOARD_INITSDHCPINS_SDHC1_CMD_PIN, SDHC1_CMD);

    const uint32_t SDHC1_DATA0 = (/* Pin is configured as SDHC1_DATA0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 33ohm */
                                  IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN19 (coords: M17) is configured as SDHC1_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SDHC1_DATA0_PORT, BOARD_INITSDHCPINS_SDHC1_DATA0_PIN, SDHC1_DATA0);

    const uint32_t SDHC1_DATA1 = (/* Pin is configured as SDHC1_DATA1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 33ohm */
                                  IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN20 (coords: M18) is configured as SDHC1_DATA1 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SDHC1_DATA1_PORT, BOARD_INITSDHCPINS_SDHC1_DATA1_PIN, SDHC1_DATA1);

    const uint32_t SDHC1_DATA2 = (/* Pin is configured as SDHC1_DATA2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 33ohm */
                                  IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN21 (coords: K18) is configured as SDHC1_DATA2 */
    IOPCTL_PinMuxSet(BOARD_INITSDHCPINS_SDHC1_DATA2_PORT, BOARD_INITSDHCPINS_SDHC1_DATA2_PIN, SDHC1_DATA2);

