Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitI3CPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t I3C0_PUR = (/* Pin is configured as I3C0_PUR */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN16 (coords: P5) is configured as I3C0_PUR */
    IOPCTL_PinMuxSet(BOARD_INITI3CPINS_I3C0_PUR_PORT, BOARD_INITI3CPINS_I3C0_PUR_PIN, I3C0_PUR);

    const uint32_t I3C0_SCL = (/* Pin is configured as I3C0_SCL */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN17 (coords: R4) is configured as I3C0_SCL */
    IOPCTL_PinMuxSet(BOARD_INITI3CPINS_I3C0_SCL_PORT, BOARD_INITI3CPINS_I3C0_SCL_PIN, I3C0_SCL);

    const uint32_t I3C0_SDA = (/* Pin is configured as I3C0_SDA */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN18 (coords: R5) is configured as I3C0_SDA */
    IOPCTL_PinMuxSet(BOARD_INITI3CPINS_I3C0_SDA_PORT, BOARD_INITI3CPINS_I3C0_SDA_PIN, I3C0_SDA);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L7, peripheral: GPIO0, signal: 'GPIO, 9', pin_signal: PIO0_9/LP_FLEXCOMM4_P6/SCT0_GPIN1/SCT0_OUT1/CTIMER0_MAT0/LP_FLEXCOMM1_P5, direction: INPUT, input_buffer: enable}
  - {pin_num: P6, peripheral: GPIO1, signal: 'GPIO, 3', pin_signal: PIO1_3/LP_FLEXCOMM0_P4/SCT0_GPIN1/SCT0_OUT7/CTIMER_C_INP8/LP_FLEXCOMM9_P6/32KHZ_CLKOUT, direction: INPUT,
    input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitBUTTONsPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t USER_Button1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin L7)  */
    GPIO_PinInit(BOARD_INITBUTTONSPINS_USER_Button1_GPIO, BOARD_INITBUTTONSPINS_USER_Button1_PIN, &USER_Button1_config);

    gpio_pin_config_t USER_Button2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin P6)  */
    GPIO_PinInit(BOARD_INITBUTTONSPINS_USER_Button2_GPIO, BOARD_INITBUTTONSPINS_USER_Button2_PIN, &USER_Button2_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t USER_Button1 = (/* Pin is configured as PIO0_9 */
                                   IOPCTL_PIO_FUNC0 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN9 (coords: L7) is configured as PIO0_9 */
    IOPCTL_PinMuxSet(BOARD_INITBUTTONSPINS_USER_Button1_PORT, BOARD_INITBUTTONSPINS_USER_Button1_PIN, USER_Button1);

