Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
    const uint32_t USER_Button2 = (/* Pin is configured as PIO1_3 */
                                   IOPCTL_PIO_FUNC0 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN3 (coords: P6) is configured as PIO1_3 */
    IOPCTL_PinMuxSet(BOARD_INITBUTTONSPINS_USER_Button2_PORT, BOARD_INITBUTTONSPINS_USER_Button2_PIN, USER_Button2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N6, peripheral: GPIO0, signal: 'GPIO, 17', pin_signal: PIO0_17/LP_FLEXCOMM6_P5/SCT0_GPIN0/SCT0_OUT0/CTIMER2_MAT0/SAI1_RX_BCLK, direction: OUTPUT}
  - {pin_num: M7, peripheral: GPIO0, signal: 'GPIO, 18', pin_signal: PIO0_18/LP_FLEXCOMM6_P6/SCT0_GPIN1/SCT0_OUT1/CTIMER2_MAT1/SAI1_RX_DATA, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitLEDsPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t P0_17_PWM_BLU_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin N6)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_GPIO, BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PIN, &P0_17_PWM_BLU_LED_config);

    gpio_pin_config_t P0_18_PWM_GRN_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin M7)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_GPIO, BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PIN, &P0_18_PWM_GRN_LED_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t P0_17_PWM_BLU_LED = (/* Pin is configured as PIO0_17 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN17 (coords: N6) is configured as PIO0_17 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PORT, BOARD_INITLEDSPINS_P0_17_PWM_BLU_LED_PIN, P0_17_PWM_BLU_LED);

    const uint32_t P0_18_PWM_GRN_LED = (/* Pin is configured as PIO0_18 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN18 (coords: M7) is configured as PIO0_18 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PORT, BOARD_INITLEDSPINS_P0_18_PWM_GRN_LED_PIN, P0_18_PWM_GRN_LED);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI0Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D17, peripheral: XSPI0, signal: SCLK0, pin_signal: PIO6_1/XSPI0_SCLK0/LP_FLEXCOMM10_P0, input_buffer: enable}
  - {pin_num: G11, peripheral: XSPI0, signal: SS0_N, pin_signal: PIO6_2/XSPI0_SS0_N/LP_FLEXCOMM10_P1, input_buffer: enable}
  - {pin_num: F13, peripheral: XSPI0, signal: 'DATA, 0', pin_signal: PIO6_3/XSPI0_DATA0/LP_FLEXCOMM10_P2, input_buffer: enable}
  - {pin_num: D14, peripheral: XSPI0, signal: 'DATA, 1', pin_signal: PIO6_4/XSPI0_DATA1/LP_FLEXCOMM10_P3, input_buffer: enable}
  - {pin_num: C15, peripheral: XSPI0, signal: 'DATA, 2', pin_signal: PIO6_5/XSPI0_DATA2/LP_FLEXCOMM10_P4, input_buffer: enable}
  - {pin_num: E13, peripheral: XSPI0, signal: 'DATA, 3', pin_signal: PIO6_6/XSPI0_DATA3/LP_FLEXCOMM10_P5, input_buffer: enable}
  - {pin_num: D15, peripheral: XSPI0, signal: DQS0, pin_signal: PIO6_7/XSPI0_DQS0/LP_FLEXCOMM10_P6, input_buffer: enable}
  - {pin_num: G13, peripheral: XSPI0, signal: 'DATA, 4', pin_signal: PIO6_8/XSPI0_DATA4/LP_FLEXCOMM13_P0/LP_FLEXCOMM11_P2, input_buffer: enable}
  - {pin_num: F15, peripheral: XSPI0, signal: 'DATA, 5', pin_signal: PIO6_9/XSPI0_DATA5/LP_FLEXCOMM13_P1/LP_FLEXCOMM11_P3, input_buffer: enable}
  - {pin_num: E14, peripheral: XSPI0, signal: 'DATA, 6', pin_signal: PIO6_10/XSPI0_DATA6/LP_FLEXCOMM13_P2/LP_FLEXCOMM11_P0, input_buffer: enable}
  - {pin_num: F14, peripheral: XSPI0, signal: 'DATA, 7', pin_signal: PIO6_11/XSPI0_DATA7/LP_FLEXCOMM13_P3/LP_FLEXCOMM11_P1, input_buffer: enable}
  - {pin_num: D16, peripheral: XSPI0, signal: SCLK0_N, pin_signal: PIO6_0/XSPI0_SCLK0_N/LP_FLEXCOMM7_P2, input_buffer: enable}
  - {pin_num: G10, peripheral: XSPI0, signal: SS1_N, pin_signal: PIO6_12/XSPI0_SS1_N, input_buffer: enable, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

