Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitXSPI0Pins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t XSPI0_SCLK0_N = (/* Pin is configured as XSPI0_SCK_A_N */
                                    IOPCTL_PIO_FUNC1 |
                                    /* Disable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_DI |
                                    /* Enable pull-down function */
                                    IOPCTL_PIO_PULLDOWN_EN |
                                    /* Enables input buffer function */
                                    IOPCTL_PIO_INBUF_EN |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI |
                                    /* Selects transmitter current drive 100ohm */
                                    IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN0 (coords: D16) is configured as XSPI0_SCK_A_N */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_PORT, BOARD_INITXSPI0PINS_XSPI0_SCLK0_N_PIN, XSPI0_SCLK0_N);

    const uint32_t XSPI0_SCLK0 = (/* Pin is configured as XSPI0_SCK_A */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN1 (coords: D17) is configured as XSPI0_SCK_A */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_SCLK0_PORT, BOARD_INITXSPI0PINS_XSPI0_SCLK0_PIN, XSPI0_SCLK0);

    const uint32_t XSPI0_DATA6 = (/* Pin is configured as XSPI0_DATA_A6 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN10 (coords: E14) is configured as XSPI0_DATA_A6 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA6_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA6_PIN, XSPI0_DATA6);

    const uint32_t XSPI0_DATA7 = (/* Pin is configured as XSPI0_DATA_A7 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN11 (coords: F14) is configured as XSPI0_DATA_A7 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA7_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA7_PIN, XSPI0_DATA7);

    const uint32_t EMMC_QRDY = (/* Pin is configured as XSPI0_PCS_A_1 */
                                IOPCTL_PIO_FUNC1 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN12 (coords: G10) is configured as XSPI0_PCS_A_1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_EMMC_QRDY_PORT, BOARD_INITXSPI0PINS_EMMC_QRDY_PIN, EMMC_QRDY);

    const uint32_t XSPI0_SS0_N = (/* Pin is configured as XSPI0_PCS_A_0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN2 (coords: G11) is configured as XSPI0_PCS_A_0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_SS0_N_PORT, BOARD_INITXSPI0PINS_XSPI0_SS0_N_PIN, XSPI0_SS0_N);

