Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
    const uint32_t XSPI0_DATA0 = (/* Pin is configured as XSPI0_DATA_A0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN3 (coords: F13) is configured as XSPI0_DATA_A0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA0_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA0_PIN, XSPI0_DATA0);

    const uint32_t XSPI0_DATA1 = (/* Pin is configured as XSPI0_DATA_A1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN4 (coords: D14) is configured as XSPI0_DATA_A1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA1_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA1_PIN, XSPI0_DATA1);

    const uint32_t XSPI0_DATA2 = (/* Pin is configured as XSPI0_DATA_A2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN5 (coords: C15) is configured as XSPI0_DATA_A2 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA2_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA2_PIN, XSPI0_DATA2);

    const uint32_t XSPI0_DATA3 = (/* Pin is configured as XSPI0_DATA_A3 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN6 (coords: E13) is configured as XSPI0_DATA_A3 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA3_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA3_PIN, XSPI0_DATA3);

    const uint32_t XSPI0_DQS0 = (/* Pin is configured as XSPI0_DQS_A_0 */
                                 IOPCTL_PIO_FUNC1 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Enables input buffer function */
                                 IOPCTL_PIO_INBUF_EN |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN7 (coords: D15) is configured as XSPI0_DQS_A_0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DQS0_PORT, BOARD_INITXSPI0PINS_XSPI0_DQS0_PIN, XSPI0_DQS0);

    const uint32_t XSPI0_DATA4 = (/* Pin is configured as XSPI0_DATA_A4 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN8 (coords: G13) is configured as XSPI0_DATA_A4 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA4_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA4_PIN, XSPI0_DATA4);

    const uint32_t XSPI0_DATA5 = (/* Pin is configured as XSPI0_DATA_A5 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT6 PIN9 (coords: F15) is configured as XSPI0_DATA_A5 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI0PINS_XSPI0_DATA5_PORT, BOARD_INITXSPI0PINS_XSPI0_DATA5_PIN, XSPI0_DATA5);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H13, peripheral: XSPI1, signal: SS0_N, pin_signal: PIO5_0/XSPI1_SS0_N/LP_FLEXCOMM13_P4}
  - {pin_num: H17, peripheral: XSPI1, signal: 'DATA, 0', pin_signal: PIO5_1/XSPI1_DATA0/LP_FLEXCOMM13_P5}
  - {pin_num: H18, peripheral: XSPI1, signal: 'DATA, 1', pin_signal: PIO5_2/XSPI1_DATA1/LP_FLEXCOMM13_P6}
  - {pin_num: F18, peripheral: XSPI1, signal: 'DATA, 2', pin_signal: PIO5_3/XSPI1_DATA2/LP_FLEXCOMM13_P0, input_buffer: enable}
  - {pin_num: F16, peripheral: XSPI1, signal: 'DATA, 3', pin_signal: PIO5_4/XSPI1_DATA3/LP_FLEXCOMM13_P1, input_buffer: enable}
  - {pin_num: G16, peripheral: XSPI1, signal: DQS0, pin_signal: PIO5_5/XSPI1_DQS0/LP_FLEXCOMM13_P2, input_buffer: enable}
  - {pin_num: E16, peripheral: XSPI1, signal: 'DATA, 4', pin_signal: PIO5_6/XSPI1_DATA4/LP_FLEXCOMM12_P3, input_buffer: enable}
  - {pin_num: K16, peripheral: XSPI1, signal: 'DATA, 5', pin_signal: PIO5_7/XSPI1_DATA5/LP_FLEXCOMM12_P0, input_buffer: enable}
  - {pin_num: H16, peripheral: XSPI1, signal: 'DATA, 6', pin_signal: PIO5_8/XSPI1_DATA6/LP_FLEXCOMM12_P1, input_buffer: enable}
  - {pin_num: J16, peripheral: XSPI1, signal: 'DATA, 7', pin_signal: PIO5_9/XSPI1_DATA7/LP_FLEXCOMM12_P2, input_buffer: enable}
  - {pin_num: F17, peripheral: XSPI1, signal: SCLK0, pin_signal: PIO5_10/XSPI1_SCLK0/LP_FLEXCOMM13_P3, input_buffer: enable}
  - {pin_num: G17, peripheral: XSPI1, signal: SS1_N, pin_signal: PIO5_11/XSPI1_SCLK0_N/LP_FLEXCOMM12_P4/XSPI1_SS1_N, input_buffer: enable}
  - {pin_num: K15, peripheral: XSPI1, signal: 'DATA, 8', pin_signal: PIO5_12/XSPI1_DATA8/LP_FLEXCOMM12_P5, input_buffer: enable, pull_enable: enable}
  - {pin_num: H15, peripheral: XSPI1, signal: 'DATA, 9', pin_signal: PIO5_13/XSPI1_DATA9/LP_FLEXCOMM12_P6, input_buffer: enable, pull_enable: enable}
  - {pin_num: M13, peripheral: XSPI1, signal: 'DATA, 10', pin_signal: PIO5_14/XSPI1_DATA10/LP_FLEXCOMM11_P0, input_buffer: enable, pull_enable: enable}
  - {pin_num: J14, peripheral: XSPI1, signal: 'DATA, 11', pin_signal: PIO5_15/XSPI1_DATA11/LP_FLEXCOMM11_P1, input_buffer: enable, pull_enable: enable}
  - {pin_num: J15, peripheral: XSPI1, signal: DQS1, pin_signal: PIO5_16/XSPI1_DQS1/LP_FLEXCOMM11_P2, input_buffer: enable}
  - {pin_num: K13, peripheral: XSPI1, signal: 'DATA, 12', pin_signal: PIO5_17/XSPI1_DATA12/LP_FLEXCOMM11_P3, input_buffer: enable, pull_enable: enable}
  - {pin_num: H14, peripheral: XSPI1, signal: 'DATA, 13', pin_signal: PIO5_18/XSPI1_DATA13/LP_FLEXCOMM11_P4, input_buffer: enable, pull_enable: enable}
  - {pin_num: L13, peripheral: XSPI1, signal: 'DATA, 14', pin_signal: PIO5_19/XSPI1_DATA14/LP_FLEXCOMM11_P5, input_buffer: enable, pull_enable: enable}
  - {pin_num: K14, peripheral: XSPI1, signal: 'DATA, 15', pin_signal: PIO5_20/XSPI1_DATA15/LP_FLEXCOMM11_P6, input_buffer: enable, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

