Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitXSPI1Pins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t XSPI1_SS0_N = (/* Pin is configured as XSPI1_PCS_A_0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN0 (coords: H13) is configured as XSPI1_PCS_A_0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_SS0_N_PORT, BOARD_INITXSPI1PINS_XSPI1_SS0_N_PIN, XSPI1_SS0_N);

    const uint32_t XSPI1_DATA0 = (/* Pin is configured as XSPI1_DATA_A0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN1 (coords: H17) is configured as XSPI1_DATA_A0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA0_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA0_PIN, XSPI1_DATA0);

    const uint32_t XSPI1_SCLK0 = (/* Pin is configured as XSPI1_SCK_A */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN10 (coords: F17) is configured as XSPI1_SCK_A */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_SCLK0_PORT, BOARD_INITXSPI1PINS_XSPI1_SCLK0_PIN, XSPI1_SCLK0);

    const uint32_t XSPI1_SCLK0_N = (/* Pin is configured as XSPI1_PCS_A_1 */
                                    IOPCTL_PIO_FUNC3 |
                                    /* Disable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_DI |
                                    /* Enable pull-down function */
                                    IOPCTL_PIO_PULLDOWN_EN |
                                    /* Enables input buffer function */
                                    IOPCTL_PIO_INBUF_EN |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI |
                                    /* Selects transmitter current drive 100ohm */
                                    IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN11 (coords: G17) is configured as XSPI1_PCS_A_1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_PORT, BOARD_INITXSPI1PINS_XSPI1_SCLK0_N_PIN, XSPI1_SCLK0_N);

    const uint32_t XSPI1_DATA8 = (/* Pin is configured as XSPI1_DATA_A8 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN12 (coords: K15) is configured as XSPI1_DATA_A8 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA8_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA8_PIN, XSPI1_DATA8);

    const uint32_t XSPI1_DATA9 = (/* Pin is configured as XSPI1_DATA_A9 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN13 (coords: H15) is configured as XSPI1_DATA_A9 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA9_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA9_PIN, XSPI1_DATA9);

    const uint32_t XSPI1_DATA10 = (/* Pin is configured as XSPI1_DATA_A10 */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN14 (coords: M13) is configured as XSPI1_DATA_A10 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA10_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA10_PIN, XSPI1_DATA10);

