Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
    const uint32_t XSPI1_DATA11 = (/* Pin is configured as XSPI1_DATA_A11 */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN15 (coords: J14) is configured as XSPI1_DATA_A11 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA11_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA11_PIN, XSPI1_DATA11);

    const uint32_t XSPI1_DQS1_16 = (/* Pin is configured as XSPI1_DQS_A_1 */
                                    IOPCTL_PIO_FUNC1 |
                                    /* Disable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_DI |
                                    /* Enable pull-down function */
                                    IOPCTL_PIO_PULLDOWN_EN |
                                    /* Enables input buffer function */
                                    IOPCTL_PIO_INBUF_EN |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI |
                                    /* Selects transmitter current drive 100ohm */
                                    IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN16 (coords: J15) is configured as XSPI1_DQS_A_1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DQS1_16_PORT, BOARD_INITXSPI1PINS_XSPI1_DQS1_16_PIN, XSPI1_DQS1_16);

    const uint32_t XSPI1_DATA12 = (/* Pin is configured as XSPI1_DATA_A12 */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN17 (coords: K13) is configured as XSPI1_DATA_A12 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA12_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA12_PIN, XSPI1_DATA12);

    const uint32_t XSPI1_DATA13 = (/* Pin is configured as XSPI1_DATA_A13 */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN18 (coords: H14) is configured as XSPI1_DATA_A13 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA13_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA13_PIN, XSPI1_DATA13);

    const uint32_t XSPI1_DATA14 = (/* Pin is configured as XSPI1_DATA_A14 */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN19 (coords: L13) is configured as XSPI1_DATA_A14 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA14_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA14_PIN, XSPI1_DATA14);

    const uint32_t XSPI1_DATA1 = (/* Pin is configured as XSPI1_DATA_A1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN2 (coords: H18) is configured as XSPI1_DATA_A1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA1_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA1_PIN, XSPI1_DATA1);

    const uint32_t XSPI1_DATA15 = (/* Pin is configured as XSPI1_DATA_A15 */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN20 (coords: K14) is configured as XSPI1_DATA_A15 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA15_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA15_PIN, XSPI1_DATA15);

    const uint32_t XSPI1_DATA2 = (/* Pin is configured as XSPI1_DATA_A2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN3 (coords: F18) is configured as XSPI1_DATA_A2 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA2_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA2_PIN, XSPI1_DATA2);

    const uint32_t XSPI1_DATA3 = (/* Pin is configured as XSPI1_DATA_A3 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN4 (coords: F16) is configured as XSPI1_DATA_A3 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DATA3_PORT, BOARD_INITXSPI1PINS_XSPI1_DATA3_PIN, XSPI1_DATA3);

    const uint32_t XSPI1_DQS0 = (/* Pin is configured as XSPI1_DQS_A_0 */
                                 IOPCTL_PIO_FUNC1 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Enables input buffer function */
                                 IOPCTL_PIO_INBUF_EN |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT5 PIN5 (coords: G16) is configured as XSPI1_DQS_A_0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI1PINS_XSPI1_DQS0_PORT, BOARD_INITXSPI1PINS_XSPI1_DQS0_PIN, XSPI1_DQS0);

