Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI2Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitXSPI2Pins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t XSPI2_SS0_N_16 = (/* Pin is configured as XSPI2_PCS_A_0 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN0 (coords: D8) is configured as XSPI2_PCS_A_0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_PORT, BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_PIN, XSPI2_SS0_N_16);

    const uint32_t XSPI2_DATA0_16 = (/* Pin is configured as XSPI2_DATA_A0 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN1 (coords: D9) is configured as XSPI2_DATA_A0 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA0_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA0_16_PIN, XSPI2_DATA0_16);

    const uint32_t XSPI2_SCLK0_16 = (/* Pin is configured as XSPI2_SCK_A */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN10 (coords: B10) is configured as XSPI2_SCK_A */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_PORT, BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_PIN, XSPI2_SCLK0_16);

    const uint32_t XSPI2_SCLK0_N_16 = (/* Pin is configured as XSPI2_SCK_A_N */
                                       IOPCTL_PIO_FUNC1 |
                                       /* Disable pull-up / pull-down function */
                                       IOPCTL_PIO_PUPD_DI |
                                       /* Enable pull-down function */
                                       IOPCTL_PIO_PULLDOWN_EN |
                                       /* Enables input buffer function */
                                       IOPCTL_PIO_INBUF_EN |
                                       /* Pseudo Output Drain is disabled */
                                       IOPCTL_PIO_PSEDRAIN_DI |
                                       /* Input function is not inverted */
                                       IOPCTL_PIO_INV_DI |
                                       /* Selects transmitter current drive 100ohm */
                                       IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN11 (coords: B11) is configured as XSPI2_SCK_A_N */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_PORT, BOARD_INITXSPI2PINS_XSPI2_SCLK0_N_16_PIN, XSPI2_SCLK0_N_16);

    const uint32_t XSPI2_DATA8_16 = (/* Pin is configured as XSPI2_DATA_A8 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN12 (coords: F11) is configured as XSPI2_DATA_A8 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA8_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA8_16_PIN, XSPI2_DATA8_16);

    const uint32_t XSPI2_DATA9_16 = (/* Pin is configured as XSPI2_DATA_A9 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN13 (coords: E8) is configured as XSPI2_DATA_A9 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA9_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA9_16_PIN, XSPI2_DATA9_16);

    const uint32_t XSPI2_DATA10_16 = (/* Pin is configured as XSPI2_DATA_A10 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN14 (coords: E12) is configured as XSPI2_DATA_A10 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PIN, XSPI2_DATA10_16);

    const uint32_t XSPI2_DATA11_16 = (/* Pin is configured as XSPI2_DATA_A11 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN15 (coords: E10) is configured as XSPI2_DATA_A11 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PIN, XSPI2_DATA11_16);

    const uint32_t XSPI2_DQS1 = (/* Pin is configured as XSPI2_DQS_A_1 */
                                 IOPCTL_PIO_FUNC1 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Enables input buffer function */
                                 IOPCTL_PIO_INBUF_EN |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN16 (coords: F10) is configured as XSPI2_DQS_A_1 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DQS1_PORT, BOARD_INITXSPI2PINS_XSPI2_DQS1_PIN, XSPI2_DQS1);

    const uint32_t XSPI2_DATA12_16 = (/* Pin is configured as XSPI2_DATA_A12 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN17 (coords: F12) is configured as XSPI2_DATA_A12 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PIN, XSPI2_DATA12_16);

    const uint32_t XSPI2_DATA13_16 = (/* Pin is configured as XSPI2_DATA_A13 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN18 (coords: E9) is configured as XSPI2_DATA_A13 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PIN, XSPI2_DATA13_16);

    const uint32_t XSPI2_DATA14_16 = (/* Pin is configured as XSPI2_DATA_A14 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT4 PIN19 (coords: D12) is configured as XSPI2_DATA_A14 */
    IOPCTL_PinMuxSet(BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PORT, BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PIN, XSPI2_DATA14_16);

