Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_PANELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitFLEXIO_PANELPins(void)
{

    /* Enables the clock for the GPIO2 module */
    CLOCK_EnableClock(kCLOCK_Gpio2);

    gpio_pin_config_t FXIO_D0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_0 (pin H2)  */
    GPIO_PinInit(BOARD_INITFLEXIO_PANELPINS_FXIO_D0_GPIO, BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PIN, &FXIO_D0_config);

    gpio_pin_config_t FXIO_D1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_1 (pin G2)  */
    GPIO_PinInit(BOARD_INITFLEXIO_PANELPINS_FXIO_D1_GPIO, BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PIN, &FXIO_D1_config);

    gpio_pin_config_t FXIO_D15_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_15 (pin D3)  */
    GPIO_PinInit(BOARD_INITFLEXIO_PANELPINS_FXIO_D15_GPIO, BOARD_INITFLEXIO_PANELPINS_FXIO_D15_PIN, &FXIO_D15_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t FXIO_D0 = (/* Pin is configured as PIO2_0 */
                              IOPCTL_PIO_FUNC0 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Disable input buffer function */
                              IOPCTL_PIO_INBUF_DI |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN0 (coords: H2) is configured as PIO2_0 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D0_PIN, FXIO_D0);

    const uint32_t FXIO_D1 = (/* Pin is configured as PIO2_1 */
                              IOPCTL_PIO_FUNC0 |
                              /* Disable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_DI |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Disable input buffer function */
                              IOPCTL_PIO_INBUF_DI |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN1 (coords: G2) is configured as PIO2_1 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D1_PIN, FXIO_D1);

    const uint32_t FXIO_D10 = (/* Pin is configured as FLEXIO_D10 */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Slow mode */
                               IOPCTL_PIO_SLEW_RATE_SLOW |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN10 (coords: F5) is configured as FLEXIO_D10 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D10_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D10_PIN, FXIO_D10);

    const uint32_t FXIO_D11 = (/* Pin is configured as FLEXIO_D11 */
                               IOPCTL_PIO_FUNC5 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Slow mode */
                               IOPCTL_PIO_SLEW_RATE_SLOW |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN11 (coords: F3) is configured as FLEXIO_D11 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D11_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D11_PIN, FXIO_D11);

