Masmiseim36/nxpSDK/boards/mimxrt700evk/multicore_examples/multicore_manager/cm33_core0/pin_mux.c
    const uint32_t FXIO_D7 = (/* Pin is configured as FLEXIO_D7 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Slow mode */
                              IOPCTL_PIO_SLEW_RATE_SLOW |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN7 (coords: G6) is configured as FLEXIO_D7 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D7_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D7_PIN, FXIO_D7);

    const uint32_t FXIO_D8 = (/* Pin is configured as FLEXIO_D8 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Slow mode */
                              IOPCTL_PIO_SLEW_RATE_SLOW |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN8 (coords: G4) is configured as FLEXIO_D8 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D8_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D8_PIN, FXIO_D8);

    const uint32_t FXIO_D9 = (/* Pin is configured as FLEXIO_D9 */
                              IOPCTL_PIO_FUNC5 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-down function */
                              IOPCTL_PIO_PULLDOWN_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Slow mode */
                              IOPCTL_PIO_SLEW_RATE_SLOW |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN9 (coords: G5) is configured as FLEXIO_D9 */
    IOPCTL_PinMuxSet(BOARD_INITFLEXIO_PANELPINS_FXIO_D9_PORT, BOARD_INITFLEXIO_PANELPINS_FXIO_D9_PIN, FXIO_D9);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
